Repository: bfoese/edible-garden-frontend
Catalog: projects/seed-sharing-app/src/i18n/messages.*.xlf
Languages: de

# formfield-error.required
source: Required
de: Pflichtfeld

# formfield-error.system-unique
source: Already taken, must be unique
de: Bereits vergeben, muss eindeutig sein

# formfield-error.invalid-email
source: Invalid email
de: Kein gültiges E-Mail Format

# formfield-error.invalid-confirm
source: Does not match with password
de: Keine Übereinstimmung

# formfield-error.regex
source: Does not fulfill requirements
de: Erfüllt nicht die Anforderungen

# formfield-error.min-length
source: Too short
de: Minimale Länge unterschritten

# formfield-error.max-length
source: Too long
de: Maximale Länger überschritten

# formfield-error.invalid-credentials
source: Invalid username or password
de: Benutzername oder Passwort ungültig

source: Reset your password
de: Passwort zurück setzen

source: Delete your account
de: Benutzerkonto löschen

source: Enter your users account verified email address and we will send you a password reset link.
de: Gib die E-Mail Adresse deines Benutzerkontos ein und wir senden dir einen Link zum Zurücksetzen deines Passwortes

source: Enter your users account email address and we will send you a link to verify that address.
de: Gib die E-Mail Adresse deines Benutzerkontos ein und wir senden dir einen Link zur Verifizierung deiner Adresse

source: Enter your users account verified email address and we will send you a link to delete your account.
de: Gib die E-Mail Adresse deines Benutzerkontos ein und wir senden dir einen Link zum Löschen deines Benutzerkontos

source: Request email
de: E-Mail anfordern

source: Request email
de: E-Mail anfordern

source: Send delete account email
de: E-Mail anfordern

source: Sign in to Krautland
de: Anmeldung bei Krautland

source: Username or email
de: Benutzername oder E-Mail

source: Password
de: Passwort

source: Forgot Password?
de: Passwort vergessen?

source: Sign in
de: Anmelden

source: Email address verified
de: E-Mail Adresse verifiziert

source: Your email address was successfully verified. You can now sign in with your credentials.
de: Deine E-Mail Adresse wurde verifiziert. Du kannst dich nun mit deinen Benutzerdaten anmelden.

source: Email address verification failed
de: E-Mail Adresse nicht verifiziert

source: Your email address could not be verified.
de: Deine E-Mail Adresse konnte nicht verifiziert werden.

source: Email verification link sent
de: E-Mail Verifizierung gesendet

source: We've sent you an email to verify your email address.
de: Wir haben dir soeben eine E-Mail zur Verifizierung deiner E-Mail Adresse gesendet.

source: Email verification required
de: Verifizierung der E-Mail Adresse erforderlich

source: If you do not have that email anymore,
de: Solltest du diese E-Mail nicht mehr haben,

source: request a new one
de: fordere eine neue an.

source: New to Krautland?
de: Neu bei Krautland?

source: Create an account.
de: Benutzerkonto erstellen

source: Your email address is not verified yet. Please follow the instructions to verify your address that we sent to you.
de: Deine E-Mail Adresse wurde noch nicht verifiziert. Bitte folge den Anweisungen in der E-Mail, die wir dir zur Verifizierung deiner Adresse gesendet hatten.

source: Create your Krautland account
de: Erstelle dein Krautland Benutzerkonto

source: Username
de: Benutzername

source: Confirm Password
de: Passwort bestätigen

source: Sign up
de: Konto erstellen

source: Reset
de: Zurücksetzen

source: Password Requirements
de: Passwort Anforderungen

source: min. length: 8
de: min. Länge: 8 Zeichen

source: at least one upper case letter
de: mindestens ein Großbuchstabe

source: at least one lower case letter
de: mindestens ein Kleinbuchstabe

source: at least one number
de: mindestens eine Zahl

source: no whitespace allowed
de: keine Leerzeichen erlaubt

source: special characters allowed
de: Sonderzeichen erlaubt
